app/views/shared/_user_info.html.erb

<span>
  	<%= pluralize(current_user.posts.count, "post") %>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 1