app/controllers/pages_controller.rb

  def home
  	@title = "Home"
  	if signed_in?
      @post  = current_user.posts.build
      @comment = current_user.comments.build
      @feed_items = current_user.feed.paginate(page: params[:page])
---
SELECT "posts".* FROM "posts" WHERE (user_id = 1) ORDER BY posts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 1
SELECT COUNT(*) FROM "posts" WHERE (user_id IN (SELECT id FROM users) OR user_id = '---