app/controllers/posts_controller.rb

  def create
  	@post = current_user.posts.build(params[:post])
    if @post.save
---
INSERT INTO "posts" ("created_at", "image", "question", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 06 Nov 2012 10:47:16 UTC +00:00], ["image", "apples.jpg"], ["question", "HELL YEAHH!"], ["updated_at", Tue, 06 Nov 2012 10:47:16 UTC +00:00], ["user_id", 1]]