app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 05 Nov 2012 12:17:13 UTC +00:00], ["email", "example@railstutorial.org"], ["name", "Friend"], ["updated_at", Mon, 05 Nov 2012 12:17:13 UTC +00:00]]
---
	def create
		@user = User.new(params[:user])
		if @user.save

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
	def index
		@title = "All users"
    	@users = User.paginate(page: params[:page])